tutorials/Ramp/steady_SA/predict/baseline/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (15 0 0);

boundaryField
{
    inlet
    {
        type              fixedValue;
        value             uniform (15 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    "(sym.*|top)"
    {
        type            symmetry;
    }
    "(bot)"
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
